cask_args appdir: "/Applications", require_sha: true

tap "homebrew/cask-cask"
tap "oven-sh/bun"

# -- Essentials
brew "git"
brew "diff-so-fancy"
brew "tmux"
brew "neovim"
brew "ripgrep"
cask "visual-studio-code"
cask "google-chrome"

# -- macOS Applications
cask "iterm2"
cask "keepingyouawake"

# -- Node
brew "nvm"
brew "rustup"

# -- Commands
brew "tree"
brew "pstree"
brew "wget"
brew "pidof"
