cask_args appdir: '/Applications'

tap 'caskroom/homebrew-cask' || true
tap 'caskroom/versions' || true

# -- Essential
brew 'vim' --override-system-vi --with-python3 --with-custom-python
brew 'bash-completion'
brew 'git'

# -- Commands
brew 'tree'
brew 'pstree'
brew 'wget'
brew 'pidof'

# -- Languages
brew 'scala' --with-docs
brew 'java7'
brew 'java8'
brew 'sbt'
brew 'sbt@0.13'

# -- Databases
brew 'mongodb'
brew 'redis'

# -- macOS Applications
cask 'iterm2'
cask 'google-chrome'
cask 'keepingyouawake'
cask 'spectacle'
