cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "oven-sh/bun"

# -- Essentials
brew "git"
brew "gh"
brew "diff-so-fancy"
brew "tmux"
brew "neovim"
brew "ripgrep"
cask "visual-studio-code"
cask "google-chrome"

# -- macOS Applications
cask "iterm2"
cask "keepingyouawake"
cask "rectangle"

# -- Node
brew "nvm"

# -- Commands
brew "tree"
brew "pstree"
brew "wget"
brew "pidof"
